In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"name":['harry','rohan','subh','biswas'],
       "marks":[99,67,78,90],
       "city":["delhi","kolkata","dehradun","bhubaneswar"]}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks         city
0   harry     99        delhi
1   rohan     67      kolkata
2    subh     78     dehradun
3  biswas     90  bhubaneswar

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv',index=False)

In [7]:
df.describe()

          marks
count   4.00000
mean   83.50000
std    13.96424
min    67.00000
25%    75.25000
50%    84.00000
75%    92.25000
max    99.00000

In [8]:
harry=pd.read_csv('friends_index_false.csv')

In [9]:
harry

     name  marks         city
0   harry     99        delhi
1   rohan     67      kolkata
2    subh     78     dehradun
3  biswas     90  bhubaneswar

In [10]:
type(harry)

pandas.core.frame.DataFrame

In [11]:
harry['marks'][0]=100

C:\Users\bibas\AppData\Local\Temp\ipykernel_23192\3894485276.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  harry['marks'][0]=100
C:\Users\bibas\AppData\Local\Temp\ipykernel_23192\3894485276.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['marks'][0]=100

In [12]:
harry

     name  marks         city
0   harry    100        delhi
1   rohan     67      kolkata
2    subh     78     dehradun
3  biswas     90  bhubaneswar

In [13]:
harry.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
harry.index=['first','second','third','fourth']

In [15]:
harry

          name  marks         city
first    harry    100        delhi
second   rohan     67      kolkata
third     subh     78     dehradun
fourth  biswas     90  bhubaneswar

In [16]:
harry['marks']

first     100
second     67
third      78
fourth     90
Name: marks, dtype: int64

In [17]:
type(harry['marks'])

pandas.core.series.Series

In [18]:
ser=pd.Series(np.random.randint(30,size=30))

In [19]:
ser

0      8
1     14
2     17
3      1
4      5
5      2
6     25
7      9
8      3
9     19
10    16
11    23
12    14
13    24
14    27
15     5
16    13
17     5
18     1
19    24
20     9
21    16
22     5
23    13
24    17
25    29
26     7
27    16
28    12
29    25
dtype: int32

In [20]:
r=pd.Series(np.random.randint(30))

In [21]:
r

0    16
dtype: int64

In [22]:
ser=pd.Series(np.random.rand(30))

In [23]:
ser

0     0.370734
1     0.743555
2     0.892431
3     0.416583
4     0.749668
5     0.351390
6     0.578157
7     0.776372
8     0.840147
9     0.520578
10    0.731833
11    0.861866
12    0.892012
13    0.301554
14    0.747735
15    0.789494
16    0.511114
17    0.856096
18    0.764614
19    0.398534
20    0.591179
21    0.501160
22    0.753570
23    0.695158
24    0.151142
25    0.424735
26    0.186756
27    0.653920
28    0.577454
29    0.640607
dtype: float64

In [24]:
np.random.rand(334,5)

array([[0.86147621, 0.17848075, 0.08321443, 0.63590992, 0.49668717],
       [0.53437778, 0.47153157, 0.21528549, 0.83241895, 0.08665551],
       [0.60670225, 0.72578539, 0.53792382, 0.07255136, 0.61629739],
       ...,
       [0.97147364, 0.9277426 , 0.22882523, 0.86328319, 0.46256921],
       [0.25937276, 0.25771869, 0.18691285, 0.21579781, 0.02947588],
       [0.62646572, 0.8147505 , 0.82131608, 0.72356677, 0.03905357]])

In [25]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [26]:
newdf

            0         1         2         3         4
0    0.043353  0.941715  0.174129  0.048951  0.534198
1    0.817326  0.544466  0.135303  0.857678  0.479594
2    0.390367  0.823817  0.184176  0.024930  0.563731
3    0.515793  0.021276  0.399995  0.586073  0.368036
4    0.798281  0.308590  0.860535  0.334894  0.693893
..        ...       ...       ...       ...       ...
329  0.746852  0.985445  0.958869  0.402973  0.252812
330  0.956103  0.903008  0.429864  0.881667  0.226672
331  0.903031  0.906857  0.165707  0.978837  0.397069
332  0.162003  0.130891  0.062603  0.704768  0.712714
333  0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [27]:
newdf.transpose()

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.043353,0.817326,0.390367,0.515793,0.798281,0.594542,0.088744,0.963649,0.677777,0.965013,...,0.576905,0.393790,0.398426,0.205141,0.596930,0.746852,0.956103,0.903031,0.162003,0.405401
1,0.941715,0.544466,0.823817,0.021276,0.308590,0.066218,0.792182,0.003246,0.834071,0.327568,...,0.643476,0.235868,0.874296,0.736579,0.932639,0.985445,0.903008,0.906857,0.130891,0.763299
2,0.174129,0.135303,0.184176,0.399995,0.860535,0.885879,0.360621,0.506336,0.402779,0.006987,...,0.491692,0.039777,0.747159,0.756730,0.520081,0.958869,0.429864,0.165707,0.062603,0.302766
3,0.048951,0.857678,0.024930,0.586073,0.334894,0.634078,0.061892,0.528819,0.707945,0.594372,...,0.717848,0.081735,0.598930,0.362924,0.225500,0.402973,0.881667,0.978837,0.704768,0.920001
4,0.534198,0.479594,0.563731,0.368036,0.693893,0.813006,0.550320,0.013286,0.658874,0.327415,...,0.184527,0.710794,0.870761,0.910265,0.066848,0.252812,0.226672,0.397069,0.712714,0.961838

In [28]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.522407    0.488270    0.507135    0.486931    0.496365
std      0.295471    0.298195    0.281852    0.293427    0.281386
min      0.001577    0.000081    0.000469    0.001005    0.001371
25%      0.274517    0.218757    0.273107    0.255698    0.266136
50%      0.525940    0.494120    0.515962    0.471628    0.483185
75%      0.799887    0.765416    0.754547    0.725766    0.738965
max      0.999517    0.994311    0.988906    0.999378    0.994639

In [29]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf.to_numpy()#it will convert to a numpy array

array([[0.04335344, 0.94171462, 0.17412874, 0.04895085, 0.53419761],
       [0.81732627, 0.54446627, 0.13530309, 0.85767787, 0.47959367],
       [0.39036686, 0.82381725, 0.1841765 , 0.02493045, 0.56373137],
       ...,
       [0.90303113, 0.9068571 , 0.16570653, 0.97883712, 0.39706895],
       [0.16200274, 0.13089056, 0.0626034 , 0.70476833, 0.71271386],
       [0.40540128, 0.76329932, 0.30276574, 0.92000072, 0.96183783]])

In [31]:
newdf[0][0]=0.696969696

C:\Users\bibas\AppData\Local\Temp\ipykernel_23192\3022759497.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]=0.696969696

In [32]:
newdf

            0         1         2         3         4
0    0.696970  0.941715  0.174129  0.048951  0.534198
1    0.817326  0.544466  0.135303  0.857678  0.479594
2    0.390367  0.823817  0.184176  0.024930  0.563731
3    0.515793  0.021276  0.399995  0.586073  0.368036
4    0.798281  0.308590  0.860535  0.334894  0.693893
..        ...       ...       ...       ...       ...
329  0.746852  0.985445  0.958869  0.402973  0.252812
330  0.956103  0.903008  0.429864  0.881667  0.226672
331  0.903031  0.906857  0.165707  0.978837  0.397069
332  0.162003  0.130891  0.062603  0.704768  0.712714
333  0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [33]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [34]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [35]:
newdf.sort_index(axis=0,ascending=False)#axis=0 for rows and axis=1 for columns for 2-D numpy array default axis is 0

            0         1         2         3         4
333  0.405401  0.763299  0.302766  0.920001  0.961838
332  0.162003  0.130891  0.062603  0.704768  0.712714
331  0.903031  0.906857  0.165707  0.978837  0.397069
330  0.956103  0.903008  0.429864  0.881667  0.226672
329  0.746852  0.985445  0.958869  0.402973  0.252812
..        ...       ...       ...       ...       ...
4    0.798281  0.308590  0.860535  0.334894  0.693893
3    0.515793  0.021276  0.399995  0.586073  0.368036
2    0.390367  0.823817  0.184176  0.024930  0.563731
1    0.817326  0.544466  0.135303  0.857678  0.479594
0    0.696970  0.941715  0.174129  0.048951  0.534198

[334 rows x 5 columns]

In [36]:
newdf2=newdf#here newdf2 is view of newdf dataframe so any changes in newdf2(i.e.view) will reflect to newdf.

In [37]:
newdf2[0][0]=12234

C:\Users\bibas\AppData\Local\Temp\ipykernel_23192\2421045811.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=12234

In [38]:
newdf2

                0         1         2         3         4
0    12234.000000  0.941715  0.174129  0.048951  0.534198
1        0.817326  0.544466  0.135303  0.857678  0.479594
2        0.390367  0.823817  0.184176  0.024930  0.563731
3        0.515793  0.021276  0.399995  0.586073  0.368036
4        0.798281  0.308590  0.860535  0.334894  0.693893
..            ...       ...       ...       ...       ...
329      0.746852  0.985445  0.958869  0.402973  0.252812
330      0.956103  0.903008  0.429864  0.881667  0.226672
331      0.903031  0.906857  0.165707  0.978837  0.397069
332      0.162003  0.130891  0.062603  0.704768  0.712714
333      0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [39]:
newdf

                0         1         2         3         4
0    12234.000000  0.941715  0.174129  0.048951  0.534198
1        0.817326  0.544466  0.135303  0.857678  0.479594
2        0.390367  0.823817  0.184176  0.024930  0.563731
3        0.515793  0.021276  0.399995  0.586073  0.368036
4        0.798281  0.308590  0.860535  0.334894  0.693893
..            ...       ...       ...       ...       ...
329      0.746852  0.985445  0.958869  0.402973  0.252812
330      0.956103  0.903008  0.429864  0.881667  0.226672
331      0.903031  0.906857  0.165707  0.978837  0.397069
332      0.162003  0.130891  0.062603  0.704768  0.712714
333      0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [40]:
newdf2=newdf.copy()#here any changes in newdf2(i.e.view) will not reflect to newdf or newdf2=newdf[:]

In [41]:
newdf2[0][0]=69

C:\Users\bibas\AppData\Local\Temp\ipykernel_23192\3725749648.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=69

In [42]:
newdf2

             0         1         2         3         4
0    69.000000  0.941715  0.174129  0.048951  0.534198
1     0.817326  0.544466  0.135303  0.857678  0.479594
2     0.390367  0.823817  0.184176  0.024930  0.563731
3     0.515793  0.021276  0.399995  0.586073  0.368036
4     0.798281  0.308590  0.860535  0.334894  0.693893
..         ...       ...       ...       ...       ...
329   0.746852  0.985445  0.958869  0.402973  0.252812
330   0.956103  0.903008  0.429864  0.881667  0.226672
331   0.903031  0.906857  0.165707  0.978837  0.397069
332   0.162003  0.130891  0.062603  0.704768  0.712714
333   0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [43]:
newdf

                0         1         2         3         4
0    12234.000000  0.941715  0.174129  0.048951  0.534198
1        0.817326  0.544466  0.135303  0.857678  0.479594
2        0.390367  0.823817  0.184176  0.024930  0.563731
3        0.515793  0.021276  0.399995  0.586073  0.368036
4        0.798281  0.308590  0.860535  0.334894  0.693893
..            ...       ...       ...       ...       ...
329      0.746852  0.985445  0.958869  0.402973  0.252812
330      0.956103  0.903008  0.429864  0.881667  0.226672
331      0.903031  0.906857  0.165707  0.978837  0.397069
332      0.162003  0.130891  0.062603  0.704768  0.712714
333      0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [44]:
newdf.loc[0,0]=654#in order to resolve ChainedAssignmentError we use loc.

In [45]:
newdf

              0         1         2         3         4
0    654.000000  0.941715  0.174129  0.048951  0.534198
1      0.817326  0.544466  0.135303  0.857678  0.479594
2      0.390367  0.823817  0.184176  0.024930  0.563731
3      0.515793  0.021276  0.399995  0.586073  0.368036
4      0.798281  0.308590  0.860535  0.334894  0.693893
..          ...       ...       ...       ...       ...
329    0.746852  0.985445  0.958869  0.402973  0.252812
330    0.956103  0.903008  0.429864  0.881667  0.226672
331    0.903031  0.906857  0.165707  0.978837  0.397069
332    0.162003  0.130891  0.062603  0.704768  0.712714
333    0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [46]:
newdf.columns=list("ABCDE")

In [47]:
newdf

              A         B         C         D         E
0    654.000000  0.941715  0.174129  0.048951  0.534198
1      0.817326  0.544466  0.135303  0.857678  0.479594
2      0.390367  0.823817  0.184176  0.024930  0.563731
3      0.515793  0.021276  0.399995  0.586073  0.368036
4      0.798281  0.308590  0.860535  0.334894  0.693893
..          ...       ...       ...       ...       ...
329    0.746852  0.985445  0.958869  0.402973  0.252812
330    0.956103  0.903008  0.429864  0.881667  0.226672
331    0.903031  0.906857  0.165707  0.978837  0.397069
332    0.162003  0.130891  0.062603  0.704768  0.712714
333    0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [48]:
newdf.loc[0,0]=69

In [49]:
newdf

              A         B         C         D         E     0
0    654.000000  0.941715  0.174129  0.048951  0.534198  69.0
1      0.817326  0.544466  0.135303  0.857678  0.479594   NaN
2      0.390367  0.823817  0.184176  0.024930  0.563731   NaN
3      0.515793  0.021276  0.399995  0.586073  0.368036   NaN
4      0.798281  0.308590  0.860535  0.334894  0.693893   NaN
..          ...       ...       ...       ...       ...   ...
329    0.746852  0.985445  0.958869  0.402973  0.252812   NaN
330    0.956103  0.903008  0.429864  0.881667  0.226672   NaN
331    0.903031  0.906857  0.165707  0.978837  0.397069   NaN
332    0.162003  0.130891  0.062603  0.704768  0.712714   NaN
333    0.405401  0.763299  0.302766  0.920001  0.961838   NaN

[334 rows x 6 columns]

In [50]:
newdf.loc[0,'A']=65445

In [51]:
newdf

                A         B         C         D         E     0
0    65445.000000  0.941715  0.174129  0.048951  0.534198  69.0
1        0.817326  0.544466  0.135303  0.857678  0.479594   NaN
2        0.390367  0.823817  0.184176  0.024930  0.563731   NaN
3        0.515793  0.021276  0.399995  0.586073  0.368036   NaN
4        0.798281  0.308590  0.860535  0.334894  0.693893   NaN
..            ...       ...       ...       ...       ...   ...
329      0.746852  0.985445  0.958869  0.402973  0.252812   NaN
330      0.956103  0.903008  0.429864  0.881667  0.226672   NaN
331      0.903031  0.906857  0.165707  0.978837  0.397069   NaN
332      0.162003  0.130891  0.062603  0.704768  0.712714   NaN
333      0.405401  0.763299  0.302766  0.920001  0.961838   NaN

[334 rows x 6 columns]

In [52]:
newdf.drop(0,axis=1)#temporary operation since result is visible in screen.

                A         B         C         D         E
0    65445.000000  0.941715  0.174129  0.048951  0.534198
1        0.817326  0.544466  0.135303  0.857678  0.479594
2        0.390367  0.823817  0.184176  0.024930  0.563731
3        0.515793  0.021276  0.399995  0.586073  0.368036
4        0.798281  0.308590  0.860535  0.334894  0.693893
..            ...       ...       ...       ...       ...
329      0.746852  0.985445  0.958869  0.402973  0.252812
330      0.956103  0.903008  0.429864  0.881667  0.226672
331      0.903031  0.906857  0.165707  0.978837  0.397069
332      0.162003  0.130891  0.062603  0.704768  0.712714
333      0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [53]:
newdf

                A         B         C         D         E     0
0    65445.000000  0.941715  0.174129  0.048951  0.534198  69.0
1        0.817326  0.544466  0.135303  0.857678  0.479594   NaN
2        0.390367  0.823817  0.184176  0.024930  0.563731   NaN
3        0.515793  0.021276  0.399995  0.586073  0.368036   NaN
4        0.798281  0.308590  0.860535  0.334894  0.693893   NaN
..            ...       ...       ...       ...       ...   ...
329      0.746852  0.985445  0.958869  0.402973  0.252812   NaN
330      0.956103  0.903008  0.429864  0.881667  0.226672   NaN
331      0.903031  0.906857  0.165707  0.978837  0.397069   NaN
332      0.162003  0.130891  0.062603  0.704768  0.712714   NaN
333      0.405401  0.763299  0.302766  0.920001  0.961838   NaN

[334 rows x 6 columns]

In [54]:
newdf=newdf.drop(0,axis=1)#permanent operation since result is not visible in screen.

In [55]:
newdf

                A         B         C         D         E
0    65445.000000  0.941715  0.174129  0.048951  0.534198
1        0.817326  0.544466  0.135303  0.857678  0.479594
2        0.390367  0.823817  0.184176  0.024930  0.563731
3        0.515793  0.021276  0.399995  0.586073  0.368036
4        0.798281  0.308590  0.860535  0.334894  0.693893
..            ...       ...       ...       ...       ...
329      0.746852  0.985445  0.958869  0.402973  0.252812
330      0.956103  0.903008  0.429864  0.881667  0.226672
331      0.903031  0.906857  0.165707  0.978837  0.397069
332      0.162003  0.130891  0.062603  0.704768  0.712714
333      0.405401  0.763299  0.302766  0.920001  0.961838

[334 rows x 5 columns]

In [56]:
newdf.loc[[1,2],['C','D']]#it takes (row name,column name)

          C         D
1  0.135303  0.857678
2  0.184176  0.024930

In [57]:
newdf.iloc[[1,2],[2,3]]#it takes (row index,column index)

          C         D
1  0.135303  0.857678
2  0.184176  0.024930

In [58]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.817326  0.544466  0.135303  0.857678  0.479594
2  0.390367  0.823817  0.184176  0.024930  0.563731

In [59]:
newdf.loc[(newdf['A']>0.3) & (newdf['C']<0.1)]

            A         B         C         D         E
9    0.965013  0.327568  0.006987  0.594372  0.327415
50   0.372516  0.145868  0.079294  0.344378  0.218163
62   0.651179  0.818728  0.058777  0.323018  0.477884
68   0.573606  0.285093  0.074408  0.311711  0.788147
96   0.365764  0.976643  0.017442  0.388332  0.058908
118  0.870448  0.867902  0.091479  0.918524  0.413797
132  0.538350  0.174101  0.086002  0.541963  0.428415
154  0.728857  0.609520  0.082459  0.901971  0.876502
230  0.887770  0.850407  0.053295  0.534369  0.296771
231  0.863721  0.263548  0.014967  0.172478  0.709833
233  0.997279  0.249313  0.034476  0.451722  0.708995
235  0.870231  0.153056  0.045290  0.985165  0.004869
243  0.368265  0.850582  0.078853  0.999378  0.609160
250  0.664465  0.517815  0.021477  0.855786  0.743587
253  0.442147  0.812668  0.054499  0.873800  0.152681
271  0.350535  0.293690  0.033697  0.976833  0.981128
309  0.740592  0.788883  0.055534  0.296841  0.280792
325  0.393790  0.235868  0.039777  0.081735  0.710794

In [60]:
newdf.iloc[0,4]

0.5341976086024319

In [61]:
newdf.drop(['A'],axis=1)

            B         C         D         E
0    0.941715  0.174129  0.048951  0.534198
1    0.544466  0.135303  0.857678  0.479594
2    0.823817  0.184176  0.024930  0.563731
3    0.021276  0.399995  0.586073  0.368036
4    0.308590  0.860535  0.334894  0.693893
..        ...       ...       ...       ...
329  0.985445  0.958869  0.402973  0.252812
330  0.903008  0.429864  0.881667  0.226672
331  0.906857  0.165707  0.978837  0.397069
332  0.130891  0.062603  0.704768  0.712714
333  0.763299  0.302766  0.920001  0.961838

[334 rows x 4 columns]

In [62]:
newdf.drop([0],axis=0)

            A         B         C         D         E
1    0.817326  0.544466  0.135303  0.857678  0.479594
2    0.390367  0.823817  0.184176  0.024930  0.563731
3    0.515793  0.021276  0.399995  0.586073  0.368036
4    0.798281  0.308590  0.860535  0.334894  0.693893
5    0.594542  0.066218  0.885879  0.634078  0.813006
..        ...       ...       ...       ...       ...
329  0.746852  0.985445  0.958869  0.402973  0.252812
330  0.956103  0.903008  0.429864  0.881667  0.226672
331  0.903031  0.906857  0.165707  0.978837  0.397069
332  0.162003  0.130891  0.062603  0.704768  0.712714
333  0.405401  0.763299  0.302766  0.920001  0.961838

[333 rows x 5 columns]

In [63]:
newdf.drop(['A','C'],axis=1,inplace=True)

In [64]:
newdf #or use newdf=newdf.drop(['A','C'],axis=1,it is a permanent operation

            B         D         E
0    0.941715  0.048951  0.534198
1    0.544466  0.857678  0.479594
2    0.823817  0.024930  0.563731
3    0.021276  0.586073  0.368036
4    0.308590  0.334894  0.693893
..        ...       ...       ...
329  0.985445  0.402973  0.252812
330  0.903008  0.881667  0.226672
331  0.906857  0.978837  0.397069
332  0.130891  0.704768  0.712714
333  0.763299  0.920001  0.961838

[334 rows x 3 columns]

In [65]:
newdf.drop([1,5],axis=0,inplace=True)

In [66]:
newdf

            B         D         E
0    0.941715  0.048951  0.534198
2    0.823817  0.024930  0.563731
3    0.021276  0.586073  0.368036
4    0.308590  0.334894  0.693893
6    0.792182  0.061892  0.550320
..        ...       ...       ...
329  0.985445  0.402973  0.252812
330  0.903008  0.881667  0.226672
331  0.906857  0.978837  0.397069
332  0.130891  0.704768  0.712714
333  0.763299  0.920001  0.961838

[332 rows x 3 columns]

In [67]:
newdf.reset_index()

     index         B         D         E
0        0  0.941715  0.048951  0.534198
1        2  0.823817  0.024930  0.563731
2        3  0.021276  0.586073  0.368036
3        4  0.308590  0.334894  0.693893
4        6  0.792182  0.061892  0.550320
..     ...       ...       ...       ...
327    329  0.985445  0.402973  0.252812
328    330  0.903008  0.881667  0.226672
329    331  0.906857  0.978837  0.397069
330    332  0.130891  0.704768  0.712714
331    333  0.763299  0.920001  0.961838

[332 rows x 4 columns]

In [68]:
newdf.reset_index(drop=True,inplace=True)#drop=True will delete the index column

In [69]:
newdf

            B         D         E
0    0.941715  0.048951  0.534198
1    0.823817  0.024930  0.563731
2    0.021276  0.586073  0.368036
3    0.308590  0.334894  0.693893
4    0.792182  0.061892  0.550320
..        ...       ...       ...
327  0.985445  0.402973  0.252812
328  0.903008  0.881667  0.226672
329  0.906857  0.978837  0.397069
330  0.130891  0.704768  0.712714
331  0.763299  0.920001  0.961838

[332 rows x 3 columns]

In [70]:
newdf.iloc[:,1]

0      0.048951
1      0.024930
2      0.586073
3      0.334894
4      0.061892
         ...
327    0.402973
328    0.881667
329    0.978837
330    0.704768
331    0.920001
Name: D, Length: 332, dtype: float64

In [71]:
newdf.iloc[:,[1]]

            D
0    0.048951
1    0.024930
2    0.586073
3    0.334894
4    0.061892
..        ...
327  0.402973
328  0.881667
329  0.978837
330  0.704768
331  0.920001

[332 rows x 1 columns]

In [72]:
newdf.loc[:,['B']]=69

In [73]:
newdf

        B         D         E
0    69.0  0.048951  0.534198
1    69.0  0.024930  0.563731
2    69.0  0.586073  0.368036
3    69.0  0.334894  0.693893
4    69.0  0.061892  0.550320
..    ...       ...       ...
327  69.0  0.402973  0.252812
328  69.0  0.881667  0.226672
329  69.0  0.978837  0.397069
330  69.0  0.704768  0.712714
331  69.0  0.920001  0.961838

[332 rows x 3 columns]

In [74]:
newdf.loc['B']=None

In [75]:
newdf

        B         D         E
0    69.0  0.048951  0.534198
1    69.0  0.024930  0.563731
2    69.0  0.586073  0.368036
3    69.0  0.334894  0.693893
4    69.0  0.061892  0.550320
..    ...       ...       ...
328  69.0  0.881667  0.226672
329  69.0  0.978837  0.397069
330  69.0  0.704768  0.712714
331  69.0  0.920001  0.961838
B     NaN       NaN       NaN

[333 rows x 3 columns]

In [76]:
newdf.drop(['B'],axis=0,inplace=True)

In [77]:
newdf

        B         D         E
0    69.0  0.048951  0.534198
1    69.0  0.024930  0.563731
2    69.0  0.586073  0.368036
3    69.0  0.334894  0.693893
4    69.0  0.061892  0.550320
..    ...       ...       ...
327  69.0  0.402973  0.252812
328  69.0  0.881667  0.226672
329  69.0  0.978837  0.397069
330  69.0  0.704768  0.712714
331  69.0  0.920001  0.961838

[332 rows x 3 columns]

In [78]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [79]:
newdf

        B         D         E
0    69.0  0.048951  0.534198
1    69.0  0.024930  0.563731
2    69.0  0.586073  0.368036
3    69.0  0.334894  0.693893
4    69.0  0.061892  0.550320
..    ...       ...       ...
327  69.0  0.402973  0.252812
328  69.0  0.881667  0.226672
329  69.0  0.978837  0.397069
330  69.0  0.704768  0.712714
331  69.0  0.920001  0.961838

[332 rows x 3 columns]

In [80]:
newdf.loc[:,['B']]=0

In [81]:
newdf

       B         D         E
0    0.0  0.048951  0.534198
1    0.0  0.024930  0.563731
2    0.0  0.586073  0.368036
3    0.0  0.334894  0.693893
4    0.0  0.061892  0.550320
..   ...       ...       ...
327  0.0  0.402973  0.252812
328  0.0  0.881667  0.226672
329  0.0  0.978837  0.397069
330  0.0  0.704768  0.712714
331  0.0  0.920001  0.961838

[332 rows x 3 columns]

In [82]:
newdf.loc[:,['B']].isnull()

         B
0    False
1    False
2    False
3    False
4    False
..     ...
327  False
328  False
329  False
330  False
331  False

[332 rows x 1 columns]

In [83]:
df=pd.DataFrame({"name":['alfred','batman','catwoman'],
                 "toy":[np.nan,'batmobile','bullwhip'],
                 "born":[pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT]} )

In [84]:
df

       name        toy       born
0    alfred        NaN        NaT
1    batman  batmobile 1940-04-25
2  catwoman   bullwhip        NaT

In [85]:
df.dropna()

     name        toy       born
1  batman  batmobile 1940-04-25

In [86]:
df.dropna(axis=1)

       name
0    alfred
1    batman
2  catwoman

In [87]:
df.dropna(how="all")

       name        toy       born
0    alfred        NaN        NaT
1    batman  batmobile 1940-04-25
2  catwoman   bullwhip        NaT

In [88]:
data={"name":['bibas','ansh','suvam','biswas'],
       "marks":[99,67,78,90],
  "city":["delhi","kolkata","dehradun","bhubaneswar"]}

In [89]:
df=pd.DataFrame(data)

In [90]:
df

     name  marks         city
0   bibas     99        delhi
1    ansh     67      kolkata
2   suvam     78     dehradun
3  biswas     90  bhubaneswar

In [91]:
df.to_excel('data.xlsx')

In [92]:
df.loc[[0],['marks']]=100

In [93]:
df

     name  marks         city
0   bibas    100        delhi
1    ansh     67      kolkata
2   suvam     78     dehradun
3  biswas     90  bhubaneswar

In [94]:
data=pd.read_excel('data.xlsx')

In [95]:
data

   Unnamed: 0    name  marks         city
0           0   bibas     99        delhi
1           1    ansh     67      kolkata
2           2   suvam     78     dehradun
3           3  biswas     90  bhubaneswar

In [96]:
data.iloc[[0],[1]]=100

In [97]:
data

   Unnamed: 0    name  marks         city
0           0     100     99        delhi
1           1    ansh     67      kolkata
2           2   suvam     78     dehradun
3           3  biswas     90  bhubaneswar

In [98]:
data.drop("Unnamed: 0",axis=1,inplace=True)

In [99]:
data

     name  marks         city
0     100     99        delhi
1    ansh     67      kolkata
2   suvam     78     dehradun
3  biswas     90  bhubaneswar

In [100]:
data1=pd.read_excel('harry.xlsx',sheet_name="Sheet1")#no Unnamed column is coming since we have uploaded it.

In [101]:
data1

,Unnamed: 0.6,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No,Speed,city
0,0,12222,12222,12222,12222,12222,12222,12222,50,rampur
1,1,1,1,1,1,1,1,12454,123,kolkata
2,2,2,2,2,2,2,2,54623,78,barelly
3,3,3,3,3,3,3,3,12452,87,antartica

In [102]:
data1.iloc[[0],[0]]=12222

In [103]:
data1

,Unnamed: 0.6,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No,Speed,city
0,12222,12222,12222,12222,12222,12222,12222,12222,50,rampur
1,1,1,1,1,1,1,1,12454,123,kolkata
2,2,2,2,2,2,2,2,54623,78,barelly
3,3,3,3,3,3,3,3,12452,87,antartica

In [104]:
data1.to_excel('harry.xlsx',sheet_name='Sheet1')